Интенсивное_обучение_программированию/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <comment>Расходная накладная покупателю</comment>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокУслуг</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интенсивное_обучение_программированию/src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТоваров

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры


&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПроцентСкидкиПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетСтрокиТоваровСписокТоваров()
	
	СтрокаРасчета 		= Элементы.СписокТоваров.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * (1 - (СтрокаРасчета.ПроцентСкидки / 100)) 
						* СтрокаРасчета.Количество;
						
КонецПроцедуры

#КонецОбласти
